doc/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-29 Mon 19:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Documentation</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Emmanuel GALLOIS" />
<link rel="stylesheet" type="text/css" href="./css/solarized-light.min.css" />

            <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
            <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>

</head>
<body>
<div id="content">
<h1 class="title">Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">The <i>Challenge</i></a></li>
<li><a href="#orgheadline12">Specifications</a>
<ul>
<li><a href="#orgheadline2">Data samples analysis</a>
<ul>
<li><a href="#orgheadline5">Input</a></li>
<li><a href="#orgheadline6">Expected outputs</a></li>
</ul>
</li>
<li><a href="#orgheadline7">Rules</a>
<ul>
<li><a href="#orgheadline8">Logic</a></li>
<li><a href="#orgheadline9">Output filename and content</a></li>
<li><a href="#orgheadline10">Interface</a></li>
<li><a href="#orgheadline11">Volumetry</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline13">Challenge answer and implementation</a>
<ul>
<li><a href="#orgheadline14">Dependencies</a></li>
<li><a href="#orgheadline19">Project</a>
<ul>
<li><a href="#orgheadline15">Tests</a></li>
<li><a href="#orgheadline16">Code</a></li>
<li><a href="#orgheadline17">Documentation</a></li>
<li><a href="#orgheadline18">How to run project</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline20">Creating sample datasets</a></li>
<li><a href="#orgheadline21">Benchmarks on datasets</a></li>
<li><a href="#orgheadline22">Final words</a></li>
</ul>
</div>
</div>
<p>
I've been asked to do an exercise / challenge for a job position. This documentation is the way I realized it.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">The <i>Challenge</i></h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Given this csv file excerpt (the file could either be very large or small):
</p>

<pre class="example">
department;date;roomA;roomB;roomC;roomD;roomE;roomF;code
HR3;2009-01-20;19;4;3;20;40;7;HALO#sig#OPEC
HR3;2009-01-19;;5;3;20;40;7;HALO##EUR
HR1;2009-01-20;19;4;3;20;40;7;
HR2;2009-01-20;19;4;3;20;40;7;GEPUR##GBP
HR3;2009-01-21;21;89;56;12;70;91;
</pre>

<p>
Write a list of csv files by department (assume no more than 10 departments)
and room. For example, for department HR3 we would output (no need for
header):
</p>

<p>
File name: <code>HR3-RoomA.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;19;HALO;OPEC
HR3;2009-01-21;21;;
</pre>

<p>
File name: <code>HR3-RoomB.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;4;HALO;OPEC
HR3;2009-01-19;5;HALO;EUR
HR3;2009-01-21;89;
</pre>

<p>
File name: <code>HR3-RoomC.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;3;HALO;OPEC
HR3;2009-01-19;3;HALO;EUR
HR3;2009-01-21;56;;
</pre>

<p>
etc.
</p>

<p>
Take into account that sometimes when the script is run, only some data needs
to be extracted (eg. only HR1, and/or only roomA and roomB). Either one or all
departments will be processed.
</p>

<p>
To the best of your ability follow development best practices (docs, tests, etc).
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Specifications</h2>
<div class="outline-text-2" id="text-orgheadline12">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Data samples analysis</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
First, let's make the CSV excerpts more readable and identify the schemas
for our application.
</p>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">Input</h4>
<div class="outline-text-4" id="text-orgheadline5">
</div><ul class="org-ul"><li><a id="orgheadline3"></a>Input data sample<br  /><div class="outline-text-5" id="text-orgheadline3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">department</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">roomA</th>
<th scope="col" class="org-right">roomB</th>
<th scope="col" class="org-right">roomC</th>
<th scope="col" class="org-right">roomD</th>
<th scope="col" class="org-right">roomE</th>
<th scope="col" class="org-right">roomF</th>
<th scope="col" class="org-left">code</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">19</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">20</td>
<td class="org-right">40</td>
<td class="org-right">7</td>
<td class="org-left">HALO#sig#OPEC</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-19</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">5</td>
<td class="org-right">3</td>
<td class="org-right">20</td>
<td class="org-right">40</td>
<td class="org-right">7</td>
<td class="org-left">HALO##EUR</td>
</tr>

<tr>
<td class="org-left">HR1</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">19</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">20</td>
<td class="org-right">40</td>
<td class="org-right">7</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HR2</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">19</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">20</td>
<td class="org-right">40</td>
<td class="org-right">7</td>
<td class="org-left">GEPUR##GBP</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-21</td>
<td class="org-right">21</td>
<td class="org-right">89</td>
<td class="org-right">56</td>
<td class="org-right">12</td>
<td class="org-right">70</td>
<td class="org-right">91</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li>

<li><a id="orgheadline4"></a>Schema<br  /><div class="outline-text-5" id="text-orgheadline4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Column name</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">canBeNull?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>deparment</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>date</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>roomA</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>roomB</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>roomC</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>roomD</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>roomE</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>roomF</code></td>
<td class="org-left">int</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>code</code></td>
<td class="org-left">string</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>

<p>
Notes:
</p>
<ul class="org-ul">
<li><code>date</code> has the format of the calendar date (see <a href="https://en.wikipedia.org/wiki/ISO_8601">ISO_8601</a>). Will be handled
as a string.</li>
<li><code>room&lt;A..F&gt;</code> columns seem to be a quantity, a count. Name it <code>count</code> in
the output schema (see details lower).</li>
<li><code>code</code> seems to represents the following structure (splitted by <code>#</code> char) :
<ul class="org-ul">
<li>Reference or stock place&#x2026; Let's name it <code>ref</code>.</li>
<li>Optional information, not used in ouput files (so skip it !). We won't name this value&#x2026;</li>
<li>Seems to be a currency in <a href="https://fr.wikipedia.org/wiki/ISO_4217">ISO 4217</a> format. Let's name it <code>cur</code>.</li>
</ul></li>
</ul>
</div></li></ul>
</div>
