doc/index.org
*** Expected outputs 

   Output data samples

    File name: =HR3-RoomA.csv=
      
   | HR3 | 2009-01-20 | 19 | HALO | OPEC |
   | HR3 | 2009-01-21 | 21 |      |      |

   File name: =HR3-RoomB.csv=
    
   | HR3 | 2009-01-20 |  4 | HALO | OPEC |
   | HR3 | 2009-01-19 |  5 | HALO | EUR  |
   | HR3 | 2009-01-21 | 89 |      |      |
   
   File name: =HR3-RoomC.csv=
     
   | HR3 | 2009-01-20 |  3 | HALO | OPEC |
   | HR3 | 2009-01-19 |  3 | HALO | EUR  |
   | HR3 | 2009-01-21 | 56 |      |      |

   Schema
    
 | column      | type   | canBeNull? |
 |-------------+--------+------------|
 | =deparment= | string | false      |
 | =date=      | string | false      |
 | =count=     | int    | false      |
 | =ref=       | string | true       |
 | =cur=       | string | true       |

** Rules

   According to the challenge definition and the provided data samples
   analysis, we will define the following rules.
   
*** Logic

    Perimeter: 
    - We have 10 departments maximum : HR1 to HR10.
    - We have 6 fixed rooms: roomA, roomB, roomC, roomD, roomE and roomF.   
      
   For each line of input file,
   - if the department match the filter or there's no department filter
    - we have to explode each room (/room<A..F>/) according to the room filter if defined
     - we will skip /empty/ =count= (room column value).
      - into one line which has the format defined below (output filename and content).

   In summary, we're making a pivot for room's columns (columns to rows).     
   
   Thus, if the department is not filtered, if all rooms have a value and are not filtered, one
   line of input source will generate 6 lines of output (one per room).\\
   Each of theses lines, will be written in a distinct file name
   =<department>-Room<room>.csv= in append mode.\\
   The =count= value will be the room value. We will repeat the =department=, add the
   =date= and eventually add the =ref= and =cur= fields if they're not null.
    
   I decided that, if the input file structure is malformed(doesn't match schema), the process rejects the
   file and warns the user.
   
*** Output filename and content
   - The output filename should be following this format =<department>-<room.capitalize>.csv=.
   - The format will be CSV with no headers, each field will be delimited by
     the =;= char and will follow the schema:

 | column      | type   | canBeNull? |
 |-------------+--------+------------|
 | =deparment= | string | false      |
 | =date=      | string | false      |
 | =count=     | int    | false      |
 | =ref=       | string | true       |
 | =cur=       | string | true       |

*** Interface
    We have to manage some parameters according to the challenge definition:
    - We can filter the source on /One/ department. If no department is provided, we take all departments.
    - We can select a list rooms for extraction. If no rooms is provided, take all rooms.
    - We can mix the previous statements : Department and Rooms, Department
      only, Rooms only or no filter at all.

*** Volumetry    
   In the challenge definition, we can read : 
  #+BEGIN_QUOTE
  /Given this csv file excerpt (the file could either be *very large* or *small*)/
  #+END_QUOTE
  We cannot know the size of the input source. It can contain 10 lines to 1 million lines or even more...\\
  To take that into account, I decided to make some tests on data samples of a small to huge volumetry.
  See the /Creating sample datasets/ section to see the size a data samples created.
      
* Challenge answer and implementation

  I follow the [[https://en.wikipedia.org/wiki/KISS_principle][KISS]] principle. So, I'll try to answer to this challenge in a
  simple but efficient way.

  The code architecture is quite simple, we will have
  - an /Interface/ for dialoging with the user requests and giving orders to the /Worker/.
  - a /Worker/ who has the job of processing the file provided.
  
  We will work on a CLI(Command-Line /Interface/) Tool written in Scala with its ecosystem.\\
  The CLI tool will accept parameters: 
   - A mandatory one : the filename to process.
   - two optionals : 
     - a =departement=, we will name the command-line option =-d= (=--department=).\\
       Example : =-d HR3=   
     - a list of =room identifiers= which belongs to the following fixed values : roomA, roomB, ... till roomF.\\
        We will shorten the parameter value to 'A' to 'F'. We will call the
       name the command-line option =-r= (=--rooms=).\\
       Example : =-r C= for roomC and =-r A,D,E= for roomA, roomD and roomE.
  
