doc/index.html

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">Expected outputs</h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
Output data samples
</p>

<p>
File name: <code>HR3-RoomA.csv</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">19</td>
<td class="org-left">HALO</td>
<td class="org-left">OPEC</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-21</td>
<td class="org-right">21</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
File name: <code>HR3-RoomB.csv</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">4</td>
<td class="org-left">HALO</td>
<td class="org-left">OPEC</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-19</td>
<td class="org-right">5</td>
<td class="org-left">HALO</td>
<td class="org-left">EUR</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-21</td>
<td class="org-right">89</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
File name: <code>HR3-RoomC.csv</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-20</td>
<td class="org-right">3</td>
<td class="org-left">HALO</td>
<td class="org-left">OPEC</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-19</td>
<td class="org-right">3</td>
<td class="org-left">HALO</td>
<td class="org-left">EUR</td>
</tr>

<tr>
<td class="org-left">HR3</td>
<td class="org-right">2009-01-21</td>
<td class="org-right">56</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Schema
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">column</th>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">canBeNull?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>deparment</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>date</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>count</code></td>
<td class="org-left">int</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>ref</code></td>
<td class="org-left">string</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>cur</code></td>
<td class="org-left">string</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">Rules</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
According to the challenge definition and the provided data samples
analysis, we will define the following rules.
</p>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">Logic</h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
Perimeter: 
</p>
<ul class="org-ul">
<li>We have 10 departments maximum : HR1 to HR10.</li>
<li>We have 6 fixed rooms: roomA, roomB, roomC, roomD, roomE and roomF.</li>
</ul>

<p>
For each line of input file,
</p>
<ul class="org-ul">
<li>if the department match the filter or there's no department filter
<ul class="org-ul">
<li>we have to explode each room (<i>room&lt;A..F&gt;</i>) according to the room filter if defined
<ul class="org-ul">
<li>we will skip <i>empty</i> <code>count</code> (room column value).
<ul class="org-ul">
<li>into one line which has the format defined below (output filename and content).</li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<p>
In summary, we're making a pivot for room's columns (columns to rows).     
</p>

<p>
Thus, if the department is not filtered, if all rooms have a value and are not filtered, one
line of input source will generate 6 lines of output (one per room).<br  />
Each of theses lines, will be written in a distinct file name
<code>&lt;department&gt;-Room&lt;room&gt;.csv</code> in append mode. <br  />
The <code>count</code> value will be the room value. We will repeat the <code>department</code>, add the
<code>date</code> and eventually add the <code>ref</code> and <code>cur</code> fields if they're not null.
</p>

<p>
I decided that, if the input file structure is malformed(doesn't match schema), the process rejects the
file and warns the user.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">Output filename and content</h4>
<div class="outline-text-4" id="text-orgheadline9">
<ul class="org-ul">
<li>The output filename should be following this format <code>&lt;department&gt;-&lt;room.capitalize&gt;.csv</code>.</li>
<li>The format will be CSV with no headers, each field will be delimited by
the <code>;</code> char and will follow the schema:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">column</th>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">canBeNull?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>deparment</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>date</code></td>
<td class="org-left">string</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>count</code></td>
<td class="org-left">int</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left"><code>ref</code></td>
<td class="org-left">string</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left"><code>cur</code></td>
<td class="org-left">string</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">Interface</h4>
<div class="outline-text-4" id="text-orgheadline10">
<p>
We have to manage some parameters according to the challenge definition:
</p>
<ul class="org-ul">
<li>We can filter the source on <i>One</i> department. If no department is provided, we take all departments.</li>
<li>We can select a list rooms for extraction. If no rooms is provided, take all rooms.</li>
<li>We can mix the previous statements : Department and Rooms, Department
only, Rooms only or no filter at all.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">Volumetry</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
In the challenge definition, we can read : 
</p>
<blockquote>
<p>
<i>Given this csv file excerpt (the file could either be <b>very large</b> or <b>small</b>)</i>
</p>
</blockquote>
<p>
We cannot know the size of the input source. It can contain 10 lines to 1 million lines or even more&#x2026;<br  />
To take that into account, I decided to make some tests on data samples of a small to huge volumetry.
See the <i>Creating sample datasets</i> section to see the size of data samples created.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Challenge answer and implementation</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
I follow the <a href="https://en.wikipedia.org/wiki/KISS_principle">KISS</a> principle. So, I'll try to answer to this challenge in a
simple but efficient way.
</p>

<p>
The code architecture is quite simple, we will have
</p>
<ul class="org-ul">
<li>an <i>Interface</i> for dialoging with the user requests and giving orders to the <i>Worker</i>.</li>
<li>a <i>Worker</i> who has the job of processing the file provided.</li>
</ul>

<p>
We will work on a CLI(Command-Line <i>Interface</i>) Tool written in Scala with its ecosystem.<br  />
The CLI tool will accept parameters: 
</p>
<ul class="org-ul">
<li>A mandatory one : the filename to process.</li>
<li>two optionals : 
<ul class="org-ul">
<li>a <code>departement</code>, we will name the command-line option <code>-d</code> (<code>--department</code>).<br  />
Example : <code>-d HR3</code></li>
<li>a list of <code>room identifiers</code> which belongs to the following fixed values : roomA, roomB, &#x2026; till roomF.<br  />
 We will shorten the parameter value to 'A' to 'F'. We will call the
name the command-line option <code>-r</code> (<code>--rooms</code>).<br  />
Example : <code>-r C</code> for roomC and <code>-r A,D,E</code> for roomA, roomD and roomE.</li>
</ul></li>
</ul>
</div>
