doc/index.org
** Dependencies

   We won't reinvent the wheel and use the some libraries for some specific features...

  The dependencies are managed automatically by sbt and are declared in [[file:../build.sbt][build.sbt]].
   
  - Command-line options parsing :: [[https://github.com/scopt/scopt][scopt]] (/simple scala command line options parsing/).


  - CSV reading and writing :: 
    CSV operations like reading and writing are in fact not very
    complicated... but can usualy be an error prone task. I chose
    [[https://nrinaudo.github.io/kantan.csv/][Kantan.csv]] (/kantan.csv is a library for CSV parsing and serialisation written in the Scala programming language/) which has a pretty way of
    handling CSV files and is quite fast (see [[https://nrinaudo.github.io/kantan.csv/tut/benchmarks.html][benchmarks]]).

    
  - Testing framework ::
    For making the application's tests, I chose [[http://www.scalatest.org/][ScalaTest]] which seems to be
       the reference on the subject for Scala.



** Project

*** Tests   
    As I followed the [[https://en.wikipedia.org/wiki/Test-driven_development][TDD]], I first wrote tests on my main components :
    - /CLI/ tests are in [[file:../src/test/scala/net/undx/challenge/CLITest.scala][CLITest.scala]].
    - /Worker/ tests are in [[file:../src/test/scala/net/undx/challenge/WorkerTest.scala][WorkerTest.scala]].

    To run the tests :
    #+BEGIN_SRC sh
    $ sbt test  
    #+END_SRC

    For continuous testing in sbt (compile and relaunch tests on each
    modification) during the implementation development :
    #+BEGIN_EXAMPLE
    > ~test
    #+END_EXAMPLE
    
*** Code

    The CLI implementation is quite simple. You can check the code in [[file:../src/main/scala/net/undx/challenge/CLI.scala][CLI.scala]].

    The Worker needed more thinking and to make some choices. As, the size of
    input source couldn't be known, we can face to very very large datasets.
    Some implementations could lead to memory problems...
    The idea is, to avoid memory problems, to build a continuous process fed by an
    iterator (reading a row at the time) which processes the row, creates the
    output structures and dumps them to the relevant files.
    
    You can check the Worker implementation in [[file:../src/main/scala/net/undx/challenge/Worker.scala][Worker.scala]].

*** Documentation
    The code is commentated, to build the scaladoc run :
    #+BEGIN_SRC sh
    $ sbt doc
    #+END_SRC
    or in sbt:
    #+BEGIN_EXAMPLE
    doc
    #+END_EXAMPLE
    Then, open =./target/scala-2.11/api/index.html= to browse the refreshed
    documentation.
    
    You can also consult it from [[file:./api/index.html][here]].
*** How to run project

    See the [[file:README.org][README]] file for running the application.
    
* Creating sample datasets <<datasets>>

  I decided to create the following datasets from randomly generated data (see [[file:../project/Build.scala][Build.scala]]) :
  - =tiny.csv= holds 100 rows.
  - =small.csv= holds 1000 rows.
  - =medium.csv= holds 100,000 rows.
  - =large.csv= holds 1,000,000 rows.
  - =huge.csv= holds 10,000,000 rows.
  These data sample can be generated by calling the command =generateDatasets= with =sbt=.
  : sbt generateDatasets

  This will create the data samples in a directory named =data= in the root folder.

  After that, you can use them to play with the application like below: 

  : sbt run -f data/huge.csv -o /Users/undx/tmp/challenge 

  (see [[file:README.org]] for usage)

* Benchmarks on datasets

  These benchmarks were made on a Mac Mini Late 2012 with an
  Intel Core i5 2.5 GHz and 8GB memory running OS X 10.11.6. (Oracle Java JDK v8).

| dataset |      #rows | Input size | integrity check | file processed | Output Generated |
|---------+------------+------------+-----------------+----------------+------------------|
|         |        <r> |        <r> |             <r> |            <r> |              <r> |
| tiny    |        100 |       4,0K |           80 ms |         169 ms |             240K |
| small   |      1,000 |        40K |          111 ms |         338 ms |             712K |
| medium  |    100,000 |       3,9M |          377 ms |        3391 ms |              41M |
| large   |  1,000,000 |        39M |         2254 ms |       23570 ms |             272M |
| huge    | 10,000,000 |       389M |        16777 ms |      219120 ms |             1.3G |

These results were produced with java : 
#+BEGIN_SRC sh
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/tiny.csv -o /Users/undx/tmp/challenge/tiny
Structure integrity check performed in 80 ms.
File processed in 169 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/small.csv -o /Users/undx/tmp/challenge/small
Structure integrity check performed in 111 ms.
File processed in 338 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/medium.csv -o /Users/undx/tmp/challenge/medium
Structure integrity check performed in 377 ms.
File processed in 3391 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/large.csv -o /Users/undx/tmp/challenge/large
Structure integrity check performed in 2254 ms.
File processed in 23570 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/huge.csv -o /Users/undx/tmp/challenge/huge
Structure integrity check performed in 16777 ms.
File processed in 219120 ms.
#+END_SRC
More efficiently in shell (I used Zsh) : 
#+BEGIN_SRC sh
for j ("tiny" "small" "medium" "large" "huge"); do 
  echo $j; 
  java -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/${j}.csv -o /Users/undx/tmp/challenge/$j; 
done
#+END_SRC


In sbt, for testing purpose : 
#+BEGIN_EXAMPLE
run -f data/tiny.csv   -o /Users/undx/tmp/challenge/tiny/
...
#+END_EXAMPLE
    
