doc/index.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">Dependencies</h3>
<div class="outline-text-3" id="text-orgheadline14">
<p>
We won't reinvent the wheel and use the some libraries for some specific features&#x2026;
</p>

<p>
The dependencies are managed automatically by sbt and are declared in <a href="../build.sbt">build.sbt</a>.
</p>

<dl class="org-dl">
<dt>Command-line options parsing</dt><dd><a href="https://github.com/scopt/scopt">scopt</a> (<i>simple scala command line options parsing</i>).</dd>
</dl>


<dl class="org-dl">
<dt>CSV reading and writing</dt><dd>CSV operations like reading and writing are in fact not very
complicated&#x2026; but can usualy be an error prone task. I chose
<a href="https://nrinaudo.github.io/kantan.csv/">Kantan.csv</a> (<i>kantan.csv is a library for CSV parsing and serialisation written in the Scala programming language</i>) which has a pretty way of
handling CSV files and is quite fast (see <a href="https://nrinaudo.github.io/kantan.csv/tut/benchmarks.html">benchmarks</a>).</dd>
</dl>


<dl class="org-dl">
<dt>Testing framework</dt><dd>For making the application's tests, I chose <a href="http://www.scalatest.org/">ScalaTest</a> which seems to be
the reference on the subject for Scala.</dd>
</dl>
</div>
</div>



<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">Project</h3>
<div class="outline-text-3" id="text-orgheadline19">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15">Tests</h4>
<div class="outline-text-4" id="text-orgheadline15">
<p>
As I followed the <a href="https://en.wikipedia.org/wiki/Test-driven_development">TDD</a>, I first wrote tests for my main components :
</p>
<ul class="org-ul">
<li><i>CLI</i> tests are in <a href="../src/test/scala/net/undx/challenge/CLITest.scala">CLITest.scala</a>.</li>
<li><i>Worker</i> tests are in <a href="../src/test/scala/net/undx/challenge/WorkerTest.scala">WorkerTest.scala</a>.</li>
</ul>

<p>
To run the tests :
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sbt test
</pre>
</div>

<p>
For continuous testing in sbt (compile and relaunch tests on each
modification) during the implementation development :
</p>
<pre class="example">
&gt; ~test
</pre>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16">Code</h4>
<div class="outline-text-4" id="text-orgheadline16">
<p>
The CLI implementation is quite simple. You can check the code in <a href="../src/main/scala/net/undx/challenge/CLI.scala">CLI.scala</a>.
</p>

<p>
The Worker needed more thinking and to make some choices. As, the size of
input source couldn't be known, we can face to very very large datasets.
Some implementations could lead to memory problems&#x2026;
The idea is, to avoid memory problems, to build a continuous process fed by an
iterator (reading a row at the time) which processes the row, creates the
output structures and dumps them to the relevant files.
</p>

<p>
You can check the Worker implementation in <a href="../src/main/scala/net/undx/challenge/Worker.scala">Worker.scala</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">Documentation</h4>
<div class="outline-text-4" id="text-orgheadline17">
<p>
The code is commentated, to build the scaladoc run :
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sbt doc
</pre>
</div>
<p>
or in sbt:
</p>
<pre class="example">
doc
</pre>
<p>
Then, open <code>./target/scala-2.11/api/index.html</code> to browse the refreshed
documentation.
</p>

<p>
You can also consult it from <a href="./api/index.html">here</a>.
</p>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">How to run project</h4>
<div class="outline-text-4" id="text-orgheadline18">
<p>
See the <a href="README.html">README</a> file for running the application.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20">Creating sample datasets</h2>
<div class="outline-text-2" id="text-orgheadline20">
<p>
I decided to create the following datasets from randomly generated data (see <a href="../project/Build.scala">Build.scala</a>) :
</p>
<ul class="org-ul">
<li><code>tiny.csv</code> holds 100 rows.</li>
<li><code>small.csv</code> holds 1000 rows.</li>
<li><code>medium.csv</code> holds 100,000 rows.</li>
<li><code>large.csv</code> holds 1,000,000 rows.</li>
<li><code>huge.csv</code> holds 10,000,000 rows.</li>
</ul>
<p>
These data sample can be generated by calling the command <code>generateDatasets</code> with <code>sbt</code>.
</p>
<pre class="example">
sbt generateDatasets
</pre>

<p>
This will create the data samples in a directory named <code>data</code> in the root folder.
</p>

<p>
After that, you can use them to play with the application like below: 
</p>

<pre class="example">
sbt run -f data/huge.csv -o /Users/undx/tmp/challenge 
</pre>

<p>
(see the <a href="README.html">README</a> file for usage)
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21">Benchmarks on datasets</h2>
<div class="outline-text-2" id="text-orgheadline21">
<p>
These benchmarks were made on a Mac Mini Late 2012 with an
Intel Core i5 2.5 GHz and 8GB memory running OS X 10.11.6. (Oracle Java JDK v8).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dataset</th>
<th scope="col" class="org-left">#rows</th>
<th scope="col" class="org-left">Input size</th>
<th scope="col" class="org-left">integrity check</th>
<th scope="col" class="org-left">file processed</th>
<th scope="col" class="org-left">Output Generated</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">tiny</td>
<td class="org-left">100</td>
<td class="org-left">4,0K</td>
<td class="org-left">80 ms</td>
<td class="org-left">169 ms</td>
<td class="org-left">240K</td>
</tr>

<tr>
<td class="org-left">small</td>
<td class="org-left">1,000</td>
<td class="org-left">40K</td>
<td class="org-left">111 ms</td>
<td class="org-left">338 ms</td>
<td class="org-left">712K</td>
</tr>

<tr>
<td class="org-left">medium</td>
<td class="org-left">100,000</td>
<td class="org-left">3,9M</td>
<td class="org-left">377 ms</td>
<td class="org-left">3391 ms</td>
<td class="org-left">41M</td>
</tr>

<tr>
<td class="org-left">large</td>
<td class="org-left">1,000,000</td>
<td class="org-left">39M</td>
<td class="org-left">2254 ms</td>
<td class="org-left">23570 ms</td>
<td class="org-left">272M</td>
</tr>

<tr>
<td class="org-left">huge</td>
<td class="org-left">10,000,000</td>
<td class="org-left">389M</td>
<td class="org-left">16777 ms</td>
<td class="org-left">219120 ms</td>
<td class="org-left">1.3G</td>
</tr>
</tbody>
</table>

<p>
These results were produced with java : 
</p>
<div class="org-src-container">

<pre class="src src-sh">$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/tiny.csv -o /Users/undx/tmp/challenge/tiny
Structure integrity check performed<span style="color: #ff7800; font-weight: bold;"> in</span> 80 ms.
File processed<span style="color: #ff7800; font-weight: bold;"> in</span> 169 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/small.csv -o /Users/undx/tmp/challenge/small
Structure integrity check performed<span style="color: #ff7800; font-weight: bold;"> in</span> 111 ms.
File processed<span style="color: #ff7800; font-weight: bold;"> in</span> 338 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/medium.csv -o /Users/undx/tmp/challenge/medium
Structure integrity check performed<span style="color: #ff7800; font-weight: bold;"> in</span> 377 ms.
File processed<span style="color: #ff7800; font-weight: bold;"> in</span> 3391 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/large.csv -o /Users/undx/tmp/challenge/large
Structure integrity check performed<span style="color: #ff7800; font-weight: bold;"> in</span> 2254 ms.
File processed<span style="color: #ff7800; font-weight: bold;"> in</span> 23570 ms.
$ java  -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/huge.csv -o /Users/undx/tmp/challenge/huge
Structure integrity check performed<span style="color: #ff7800; font-weight: bold;"> in</span> 16777 ms.
File processed<span style="color: #ff7800; font-weight: bold;"> in</span> 219120 ms.
</pre>
</div>
<p>
More efficiently in shell (I used Zsh) : 
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7800; font-weight: bold;">for</span> j <span style="color: #707183;">(</span><span style="color: #409b1c;">"tiny"</span> <span style="color: #409b1c;">"small"</span> <span style="color: #409b1c;">"medium"</span> <span style="color: #409b1c;">"large"</span> <span style="color: #409b1c;">"huge"</span><span style="color: #707183;">)</span>; <span style="color: #ff7800; font-weight: bold;">do</span> 
  <span style="color: #000000; background-color: #f8f8ff;">echo</span> $<span style="color: #671ebb;">j</span>; 
  java -jar target/scala-2.11/challenge_2.11-1.0.0-one-jar.jar -f data/$<span style="color: #707183;">{</span><span style="color: #671ebb;">j</span><span style="color: #707183;">}</span>.csv -o /Users/undx/tmp/challenge/$<span style="color: #671ebb;">j</span>; 
<span style="color: #ff7800; font-weight: bold;">done</span>
</pre>
</div>


<p>
In sbt, for testing purpose : 
</p>
<pre class="example">
run -f data/tiny.csv   -o /Users/undx/tmp/challenge/tiny/
...
</pre>
</div>
</div>
