doc/index.org
* Final words
  
  This was my first steps in Scala programming and I find this language very
  interesting and motivating. Sometimes the syntax is a little bit odd but you
  can do powerful things. I tried to follow the conventions and languages
  idioms, but /It's a long way to the top/...

    

