doc/index.html

<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22">Final words</h2>
<div class="outline-text-2" id="text-orgheadline22">
<p>
This was my first steps in Scala programming and I find this language very
interesting and motivating. Sometimes the syntax is a little bit odd but you
can do powerful things. I tried to follow the conventions and languages
idioms, but <i>It's a long way to the top</i>&#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
